luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_regdef.h
/** \brief  CRCIOV Set Register */
typedef struct _Ifx_PSI5_CRCISET_Bits
{
    unsigned int CRCI0:1;                   /**< \brief [0:0] Set CRCI Flag of Buffer 0 (w) */
    unsigned int CRCI1:1;                   /**< \brief [1:1] Set CRCI Flag of Buffer 1 (w) */
    unsigned int CRCI2:1;                   /**< \brief [2:2] Set CRCI Flag of Buffer 2 (w) */
    unsigned int CRCI3:1;                   /**< \brief [3:3] Set CRCI Flag of Buffer 3 (w) */
    unsigned int CRCI4:1;                   /**< \brief [4:4] Set CRCI Flag of Buffer 4 (w) */
    unsigned int CRCI5:1;                   /**< \brief [5:5] Set CRCI Flag of Buffer 5 (w) */
    unsigned int CRCI6:1;                   /**< \brief [6:6] Set CRCI Flag of Buffer 6 (w) */
    unsigned int CRCI7:1;                   /**< \brief [7:7] Set CRCI Flag of Buffer 7 (w) */
    unsigned int CRCI8:1;                   /**< \brief [8:8] Set CRCI Flag of Buffer 8 (w) */
    unsigned int CRCI9:1;                   /**< \brief [9:9] Set CRCI Flag of Buffer 9 (w) */
    unsigned int CRCI10:1;                  /**< \brief [10:10] Set CRCI Flag of Buffer 10 (w) */
    unsigned int CRCI11:1;                  /**< \brief [11:11] Set CRCI Flag of Buffer 11 (w) */
    unsigned int CRCI12:1;                  /**< \brief [12:12] Set CRCI Flag of Buffer 12 (w) */
    unsigned int CRCI13:1;                  /**< \brief [13:13] Set CRCI Flag of Buffer 13 (w) */
    unsigned int CRCI14:1;                  /**< \brief [14:14] Set CRCI Flag of Buffer 14 (w) */
    unsigned int CRCI15:1;                  /**< \brief [15:15] Set CRCI Flag of Buffer 15 (w) */
    unsigned int CRCI16:1;                  /**< \brief [16:16] Set CRCI Flag of Buffer 16 (w) */
    unsigned int CRCI17:1;                  /**< \brief [17:17] Set CRCI Flag of Buffer 17 (w) */
    unsigned int CRCI18:1;                  /**< \brief [18:18] Set CRCI Flag of Buffer 18 (w) */
    unsigned int CRCI19:1;                  /**< \brief [19:19] Set CRCI Flag of Buffer 19 (w) */
    unsigned int CRCI20:1;                  /**< \brief [20:20] Set CRCI Flag of Buffer 20 (w) */
    unsigned int CRCI21:1;                  /**< \brief [21:21] Set CRCI Flag of Buffer 21 (w) */
    unsigned int CRCI22:1;                  /**< \brief [22:22] Set CRCI Flag of Buffer 22 (w) */
    unsigned int CRCI23:1;                  /**< \brief [23:23] Set CRCI Flag of Buffer 23 (w) */
    unsigned int CRCI24:1;                  /**< \brief [24:24] Set CRCI Flag of Buffer 24 (w) */
    unsigned int CRCI25:1;                  /**< \brief [25:25] Set CRCI Flag of Buffer 25 (w) */
    unsigned int CRCI26:1;                  /**< \brief [26:26] Set CRCI Flag of Buffer 26 (w) */
    unsigned int CRCI27:1;                  /**< \brief [27:27] Set CRCI Flag of Buffer 27 (w) */
    unsigned int CRCI28:1;                  /**< \brief [28:28] Set CRCI Flag of Buffer 28 (w) */
    unsigned int CRCI29:1;                  /**< \brief [29:29] Set CRCI Flag of Buffer 29 (w) */
    unsigned int CRCI30:1;                  /**< \brief [30:30] Set CRCI Flag of Buffer 30 (w) */
    unsigned int CRCI31:1;                  /**< \brief [31:31] Set CRCI Flag of Buffer 31 (w) */
} Ifx_PSI5_CRCISET_Bits;

/** \brief  Fractional Divider Register */
typedef struct _Ifx_PSI5_FDR_Bits
{
    unsigned int STEP:10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int RESULT:10;                 /**< \brief [25:16] Result Value (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_PSI5_FDR_Bits;

/** \brief  Fractional Divider Register for Time Stamp */
typedef struct _Ifx_PSI5_FDRT_Bits
{
    unsigned int STEP:10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int RESULT:10;                 /**< \brief [25:16] Result Value (rh) */
    unsigned int ECS:3;                     /**< \brief [28:26] External Time Stamp Clear Source Select (rw) */
    unsigned int ECEA:1;                    /**< \brief [29:29] External Time Stamp Clear Enable A (rw) */
    unsigned int ECEB:1;                    /**< \brief [30:30] External Time Stamp Clear Enable B (rw) */
    unsigned int ECEC:1;                    /**< \brief [31:31] External Time Stamp Clear Enable C (rw) */
} Ifx_PSI5_FDRT_Bits;

/** \brief  Global Control Register */
typedef struct _Ifx_PSI5_GCR_Bits
{
    unsigned int CRCI:1;                    /**< \brief [0:0] CRCI (rw) */
    unsigned int NBI:1;                     /**< \brief [1:1] NBI (rw) */
    unsigned int MEI:1;                     /**< \brief [2:2] MEI (rw) */
    unsigned int NFI:1;                     /**< \brief [3:3] NFI (rw) */
    unsigned int TEI:1;                     /**< \brief [4:4] TEI (rw) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int ETC0:1;                    /**< \brief [8:8] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int ETC1:1;                    /**< \brief [9:9] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int ETC2:1;                    /**< \brief [10:10] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int ETC3:1;                    /**< \brief [11:11] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int ETC4:1;                    /**< \brief [12:12] Enable Channel Trigger Counter CTVx.CTC (rw) */
    unsigned int reserved_13:3;             /**< \brief \internal Reserved */
    unsigned int CEN0:1;                    /**< \brief [16:16] Enable Channel (rw) */
    unsigned int CEN1:1;                    /**< \brief [17:17] Enable Channel (rw) */
    unsigned int CEN2:1;                    /**< \brief [18:18] Enable Channel (rw) */
    unsigned int CEN3:1;                    /**< \brief [19:19] Enable Channel (rw) */
    unsigned int CEN4:1;                    /**< \brief [20:20] Enable Channel (rw) */
    unsigned int reserved_21:11;            /**< \brief \internal Reserved */
} Ifx_PSI5_GCR_Bits;

/** \brief  Module Identification Register */
typedef struct _Ifx_PSI5_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_PSI5_ID_Bits;

/** \brief  Interrupt Node Pointer Register */
typedef struct _Ifx_PSI5_INP_Bits
{
    unsigned int RSI:4;                     /**< \brief [3:0] Interrupt Node Pointer for Interrupt RSI (rw) */
    unsigned int RDI:4;                     /**< \brief [7:4] Interrupt Node Pointer for Interrupt RDI (rw) */
    unsigned int RBI:4;                     /**< \brief [11:8] Interrupt Node Pointer for Interrupt RBI (rw) */
    unsigned int TDI:4;                     /**< \brief [15:12] Interrupt Node Pointer for Interrupt TDI (rw) */
    unsigned int TBI:4;                     /**< \brief [19:16] Interrupt Node Pointer for Interrupt TBI (rw) */
    unsigned int ERRI:4;                    /**< \brief [23:20] Interrupt Node Pointer for Interrupt ERRI (rw) */
    unsigned int SDI:4;                     /**< \brief [27:24] Interrupt Node Pointer for Interrupt SDI (rw) */
    unsigned int FWI:4;                     /**< \brief [31:28] Interrupt Node Pointer for FWI (rw) */
} Ifx_PSI5_INP_Bits;

/** \brief  Interrupt Clear Register A */
typedef struct _Ifx_PSI5_INTCLRA_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Clear Interrupt Request Flag RSI (w) */
    unsigned int RDI:1;                     /**< \brief [1:1] Clear Interrupt Request Flag RDI (w) */
    unsigned int RBI:1;                     /**< \brief [2:2] Clear Interrupt Request Flag RBI (w) */
    unsigned int TEI:1;                     /**< \brief [3:3] Clear Interrupt Request Flag TEI (w) */
    unsigned int NBI:1;                     /**< \brief [4:4] Clear Interrupt Request Flag NBI (w) */
    unsigned int MEI:1;                     /**< \brief [5:5] Clear Interrupt Request Flag MEI (w) */
    unsigned int CRCI:1;                    /**< \brief [6:6] Clear Interrupt Request Flag CRCI (w) */
    unsigned int FWI:1;                     /**< \brief [7:7] Clear Interrupt Request Flag FWI (w) */
    unsigned int RUI:1;                     /**< \brief [8:8] Clear Interrupt Request Flag RUI (w) */
    unsigned int RMI:1;                     /**< \brief [9:9] Clear Interrupt Request Flag RMI (w) */
    unsigned int TPI:1;                     /**< \brief [10:10] Clear Interrupt Request Flag TPI (w) */
    unsigned int TPOI:1;                    /**< \brief [11:11] Clear Interrupt Request Flag TPOI (w) */
    unsigned int TSI:1;                     /**< \brief [12:12] Clear Interrupt Request Flag TSI (w) */
    unsigned int TSOI:1;                    /**< \brief [13:13] Clear Interrupt Request Flag TSOI (w) */
    unsigned int TOI:1;                     /**< \brief [14:14] Clear Interrupt Request Flag TOI (w) */
    unsigned int TOOI:1;                    /**< \brief [15:15] Clear Interrupt Request Flag TOOI (w) */
    unsigned int NFI:1;                     /**< \brief [16:16] Clear Interrupt Request Flag NFI (w) */
    unsigned int reserved_17:15;            /**< \brief \internal Reserved */
} Ifx_PSI5_INTCLRA_Bits;

/** \brief  Interrupt Clear Register A */
typedef struct _Ifx_PSI5_INTCLRB_Bits
{
    unsigned int WSI0:1;                    /**< \brief [0:0] Clear Interrupt Request Flag WSI0 (w) */
    unsigned int WSI1:1;                    /**< \brief [1:1] Clear Interrupt Request Flag WSI1 (w) */
    unsigned int WSI2:1;                    /**< \brief [2:2] Clear Interrupt Request Flag WSI2 (w) */
    unsigned int WSI3:1;                    /**< \brief [3:3] Clear Interrupt Request Flag WSI3 (w) */
    unsigned int WSI4:1;                    /**< \brief [4:4] Clear Interrupt Request Flag WSI4 (w) */
    unsigned int WSI5:1;                    /**< \brief [5:5] Clear Interrupt Request Flag WSI5 (w) */
    unsigned int SDI0:1;                    /**< \brief [6:6] Clear Interrupt Request Flag SDI0 (w) */
    unsigned int SDI1:1;                    /**< \brief [7:7] Clear Interrupt Request Flag SDI1 (w) */
    unsigned int SDI2:1;                    /**< \brief [8:8] Clear Interrupt Request Flag SDI2 (w) */
    unsigned int SDI3:1;                    /**< \brief [9:9] Clear Interrupt Request Flag SDI3 (w) */
    unsigned int SDI4:1;                    /**< \brief [10:10] Clear Interrupt Request Flag SDI4 (w) */
    unsigned int SDI5:1;                    /**< \brief [11:11] Clear Interrupt Request Flag SDI5 (w) */
    unsigned int SOI0:1;                    /**< \brief [12:12] Clear Interrupt Request Flag SOI0 (w) */
    unsigned int SOI1:1;                    /**< \brief [13:13] Clear Interrupt Request Flag SOI1 (w) */
    unsigned int SOI2:1;                    /**< \brief [14:14] Clear Interrupt Request Flag SOI2 (w) */
    unsigned int SOI3:1;                    /**< \brief [15:15] Clear Interrupt Request Flag SOI3 (w) */
    unsigned int SOI4:1;                    /**< \brief [16:16] Clear Interrupt Request Flag SOI4 (w) */
    unsigned int SOI5:1;                    /**< \brief [17:17] Clear Interrupt Request Flag SOI5 (w) */
    unsigned int SCRI0:1;                   /**< \brief [18:18] Clear Interrupt Request Flag SCRI0 (w) */
    unsigned int SCRI1:1;                   /**< \brief [19:19] Clear Interrupt Request Flag SCRI1 (w) */
    unsigned int SCRI2:1;                   /**< \brief [20:20] Clear Interrupt Request Flag SCRI2 (w) */
    unsigned int SCRI3:1;                   /**< \brief [21:21] Clear Interrupt Request Flag SCRI3 (w) */
    unsigned int SCRI4:1;                   /**< \brief [22:22] Clear Interrupt Request Flag SCRI4 (w) */
    unsigned int SCRI5:1;                   /**< \brief [23:23] Clear Interrupt Request Flag SCRI5 (w) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_PSI5_INTCLRB_Bits;

/** \brief  Interrupt Enable Register A */
typedef struct _Ifx_PSI5_INTENA_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Enable Interrupt Request RSI (rw) */
    unsigned int RDI:1;                     /**< \brief [1:1] Enable Interrupt Request RDI (rw) */
    unsigned int RBI:1;                     /**< \brief [2:2] Enable Interrupt Request RBI (rw) */
    unsigned int TEI:1;                     /**< \brief [3:3] Enable Interrupt Request TEI (rw) */
    unsigned int NBI:1;                     /**< \brief [4:4] Enable Interrupt Request NBI (rw) */
    unsigned int MEI:1;                     /**< \brief [5:5] Enable Interrupt Request MEII (rw) */
    unsigned int CRCI:1;                    /**< \brief [6:6] Enable Interrupt Request CRCI (rw) */
    unsigned int FWI:1;                     /**< \brief [7:7] Enable Interrupt Request FWI (rw) */
    unsigned int RUI:1;                     /**< \brief [8:8] Enable Interrupt Request RUI (rw) */
    unsigned int RMI:1;                     /**< \brief [9:9] Enable Interrupt Request RMII (rw) */
    unsigned int TPI:1;                     /**< \brief [10:10] Enable Interrupt Request TPI (rw) */
    unsigned int TPOI:1;                    /**< \brief [11:11] Enable Interrupt Request TPOI (rw) */
    unsigned int TSI:1;                     /**< \brief [12:12] Enable Interrupt Request TSI (rw) */
    unsigned int TSOI:1;                    /**< \brief [13:13] Enable Interrupt Request TSOI (rw) */
    unsigned int TOI:1;                     /**< \brief [14:14] Enable Interrupt Request TOI (rw) */
    unsigned int TOOI:1;                    /**< \brief [15:15] Enable Interrupt Request TOOI (rw) */
    unsigned int NFI:1;                     /**< \brief [16:16] Enable Interrupt Request NFI (rw) */
    unsigned int reserved_17:15;            /**< \brief \internal Reserved */
} Ifx_PSI5_INTENA_Bits;

/** \brief  Interrupt Enable Register B */
typedef struct _Ifx_PSI5_INTENB_Bits
{
    unsigned int WSI0:1;                    /**< \brief [0:0] Enable Interrupt Request WSI0 (rw) */
    unsigned int WSI1:1;                    /**< \brief [1:1] Enable Interrupt Request WSI1 (rw) */
    unsigned int WSI2:1;                    /**< \brief [2:2] Enable Interrupt Request WSI2 (rw) */
    unsigned int WSI3:1;                    /**< \brief [3:3] Enable Interrupt Request WSI3 (rw) */
    unsigned int WSI4:1;                    /**< \brief [4:4] Enable Interrupt Request WSI4 (rw) */
    unsigned int WSI5:1;                    /**< \brief [5:5] Enable Interrupt Request WSI5 (rw) */
    unsigned int SDI0:1;                    /**< \brief [6:6] Enable Interrupt Request SDI0 (rw) */
    unsigned int SDI1:1;                    /**< \brief [7:7] Enable Interrupt Request SDI1 (rw) */
    unsigned int SDI2:1;                    /**< \brief [8:8] Enable Interrupt Request SDI2 (rw) */
    unsigned int SDI3:1;                    /**< \brief [9:9] Enable Interrupt Request SDI3 (rw) */
    unsigned int SDI4:1;                    /**< \brief [10:10] Enable Interrupt Request SDI4 (rw) */
    unsigned int SDI5:1;                    /**< \brief [11:11] Enable Interrupt Request SDI5 (rw) */
    unsigned int SOI0:1;                    /**< \brief [12:12] Enable Interrupt Request SOI0 (rw) */
    unsigned int SOI1:1;                    /**< \brief [13:13] Enable Interrupt Request SOI1 (rw) */
    unsigned int SOI2:1;                    /**< \brief [14:14] Enable Interrupt Request SOI2 (rw) */
    unsigned int SOI3:1;                    /**< \brief [15:15] Enable Interrupt Request SOI3 (rw) */
    unsigned int SOI4:1;                    /**< \brief [16:16] Enable Interrupt Request SOI4 (rw) */
    unsigned int SOI5:1;                    /**< \brief [17:17] Enable Interrupt Request SOI5 (rw) */
    unsigned int SCRI0:1;                   /**< \brief [18:18] Enable Interrupt Request SCRI0 (rw) */
    unsigned int SCRI1:1;                   /**< \brief [19:19] Enable Interrupt Request SCRI1 (rw) */
    unsigned int SCRI2:1;                   /**< \brief [20:20] Enable Interrupt Request SCRI2 (rw) */
    unsigned int SCRI3:1;                   /**< \brief [21:21] Enable Interrupt Request SCRI3 (rw) */
    unsigned int SCRI4:1;                   /**< \brief [22:22] Enable Interrupt Request SCRI4 (rw) */
    unsigned int SCRI5:1;                   /**< \brief [23:23] Enable Interrupt Request SCRI5 (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_PSI5_INTENB_Bits;

/** \brief  Interrupt Overview Register */
typedef struct _Ifx_PSI5_INTOV_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Interrupt Pending on any Node Pointer RSI (rh) */
    unsigned int RDI:1;                     /**< \brief [1:1] Interrupt Pending on any Node Pointer RDI (rh) */
    unsigned int RBI:1;                     /**< \brief [2:2] Interrupt Pending on any Node Pointer RBI (rh) */
    unsigned int TDI:1;                     /**< \brief [3:3] Interrupt Pending on any Node Pointer TDI (rh) */
    unsigned int TBI:1;                     /**< \brief [4:4] Interrupt Pending on any Node Pointer TBI (rh) */
    unsigned int ERRI:1;                    /**< \brief [5:5] Interrupt Pending on any Node Pointer ERRI (rh) */
    unsigned int SDI:1;                     /**< \brief [6:6] Interrupt Pending on any Node Pointer SDI (rh) */
    unsigned int FWI:1;                     /**< \brief [7:7] Interrupt Pending on any Node Pointer FWI (rh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_PSI5_INTOV_Bits;

/** \brief  Interrupt Set Register A */
typedef struct _Ifx_PSI5_INTSETA_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Set Interrupt Request Flag RSI (w) */
    unsigned int RDI:1;                     /**< \brief [1:1] Set Interrupt Request Flag RDI (w) */
    unsigned int RBI:1;                     /**< \brief [2:2] Set Interrupt Request Flag RBI (w) */
    unsigned int TEI:1;                     /**< \brief [3:3] Set Interrupt Request Flag TEI (w) */
    unsigned int NBI:1;                     /**< \brief [4:4] Set Interrupt Request Flag NBI (w) */
    unsigned int MEI:1;                     /**< \brief [5:5] Set Interrupt Request Flag MEI (w) */
    unsigned int CRCI:1;                    /**< \brief [6:6] Set Interrupt Request Flag CRCI (w) */
    unsigned int FWI:1;                     /**< \brief [7:7] Set Interrupt Request Flag FWI (w) */
    unsigned int RUI:1;                     /**< \brief [8:8] Set Interrupt Request Flag RUI (w) */
    unsigned int RMI:1;                     /**< \brief [9:9] Set Interrupt Request Flag RMI (w) */
    unsigned int TPI:1;                     /**< \brief [10:10] Set Interrupt Request Flag TPI (w) */
    unsigned int TPOI:1;                    /**< \brief [11:11] Set Interrupt Request Flag TPOI (w) */
    unsigned int TSI:1;                     /**< \brief [12:12] Set Interrupt Request Flag TSI (w) */
    unsigned int TSOI:1;                    /**< \brief [13:13] Set Interrupt Request Flag TSOI (w) */
    unsigned int TOI:1;                     /**< \brief [14:14] Set Interrupt Request Flag TOI (w) */
    unsigned int TOOI:1;                    /**< \brief [15:15] Set Interrupt Request Flag TOOI (w) */
    unsigned int NFI:1;                     /**< \brief [16:16] Set Interrupt Request Flag NFI (w) */
    unsigned int reserved_17:15;            /**< \brief \internal Reserved */
} Ifx_PSI5_INTSETA_Bits;

