luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_regdef.h
/** \brief  RSIOV Clear Register */
typedef struct _Ifx_PSI5_RSICLR_Bits
{
    unsigned int RSI0:1;                    /**< \brief [0:0] Clear RSI Flag of Buffer 0 (w) */
    unsigned int RSI1:1;                    /**< \brief [1:1] Clear RSI Flag of Buffer 1 (w) */
    unsigned int RSI2:1;                    /**< \brief [2:2] Clear RSI Flag of Buffer 2 (w) */
    unsigned int RSI3:1;                    /**< \brief [3:3] Clear RSI Flag of Buffer 3 (w) */
    unsigned int RSI4:1;                    /**< \brief [4:4] Clear RSI Flag of Buffer 4 (w) */
    unsigned int RSI5:1;                    /**< \brief [5:5] Clear RSI Flag of Buffer 5 (w) */
    unsigned int RSI6:1;                    /**< \brief [6:6] Clear RSI Flag of Buffer 6 (w) */
    unsigned int RSI7:1;                    /**< \brief [7:7] Clear RSI Flag of Buffer 7 (w) */
    unsigned int RSI8:1;                    /**< \brief [8:8] Clear RSI Flag of Buffer 8 (w) */
    unsigned int RSI9:1;                    /**< \brief [9:9] Clear RSI Flag of Buffer 9 (w) */
    unsigned int RSI10:1;                   /**< \brief [10:10] Clear RSI Flag of Buffer 10 (w) */
    unsigned int RSI11:1;                   /**< \brief [11:11] Clear RSI Flag of Buffer 11 (w) */
    unsigned int RSI12:1;                   /**< \brief [12:12] Clear RSI Flag of Buffer 12 (w) */
    unsigned int RSI13:1;                   /**< \brief [13:13] Clear RSI Flag of Buffer 13 (w) */
    unsigned int RSI14:1;                   /**< \brief [14:14] Clear RSI Flag of Buffer 14 (w) */
    unsigned int RSI15:1;                   /**< \brief [15:15] Clear RSI Flag of Buffer 15 (w) */
    unsigned int RSI16:1;                   /**< \brief [16:16] Clear RSI Flag of Buffer 16 (w) */
    unsigned int RSI17:1;                   /**< \brief [17:17] Clear RSI Flag of Buffer 17 (w) */
    unsigned int RSI18:1;                   /**< \brief [18:18] Clear RSI Flag of Buffer 18 (w) */
    unsigned int RSI19:1;                   /**< \brief [19:19] Clear RSI Flag of Buffer 19 (w) */
    unsigned int RSI20:1;                   /**< \brief [20:20] Clear RSI Flag of Buffer 20 (w) */
    unsigned int RSI21:1;                   /**< \brief [21:21] Clear RSI Flag of Buffer 21 (w) */
    unsigned int RSI22:1;                   /**< \brief [22:22] Clear RSI Flag of Buffer 22 (w) */
    unsigned int RSI23:1;                   /**< \brief [23:23] Clear RSI Flag of Buffer 23 (w) */
    unsigned int RSI24:1;                   /**< \brief [24:24] Clear RSI Flag of Buffer 24 (w) */
    unsigned int RSI25:1;                   /**< \brief [25:25] Clear RSI Flag of Buffer 25 (w) */
    unsigned int RSI26:1;                   /**< \brief [26:26] Clear RSI Flag of Buffer 26 (w) */
    unsigned int RSI27:1;                   /**< \brief [27:27] Clear RSI Flag of Buffer 27 (w) */
    unsigned int RSI28:1;                   /**< \brief [28:28] Clear RSI Flag of Buffer 28 (w) */
    unsigned int RSI29:1;                   /**< \brief [29:29] Clear RSI Flag of Buffer 29 (w) */
    unsigned int RSI30:1;                   /**< \brief [30:30] Clear RSI Flag of Buffer 30 (w) */
    unsigned int RSI31:1;                   /**< \brief [31:31] Clear RSI Flag of Buffer 31 (w) */
} Ifx_PSI5_RSICLR_Bits;

/** \brief  RSI Overview Register */
typedef struct _Ifx_PSI5_RSIOV_Bits
{
    unsigned int RSI0:1;                    /**< \brief [0:0] RSI Flag of Buffer 0 (rh) */
    unsigned int RSI1:1;                    /**< \brief [1:1] RSI Flag of Buffer 1 (rh) */
    unsigned int RSI2:1;                    /**< \brief [2:2] RSI Flag of Buffer 2 (rh) */
    unsigned int RSI3:1;                    /**< \brief [3:3] RSI Flag of Buffer 3 (rh) */
    unsigned int RSI4:1;                    /**< \brief [4:4] RSI Flag of Buffer 4 (rh) */
    unsigned int RSI5:1;                    /**< \brief [5:5] RSI Flag of Buffer 5 (rh) */
    unsigned int RSI6:1;                    /**< \brief [6:6] RSI Flag of Buffer 6 (rh) */
    unsigned int RSI7:1;                    /**< \brief [7:7] RSI Flag of Buffer 7 (rh) */
    unsigned int RSI8:1;                    /**< \brief [8:8] RSI Flag of Buffer 8 (rh) */
    unsigned int RSI9:1;                    /**< \brief [9:9] RSI Flag of Buffer 9 (rh) */
    unsigned int RSI10:1;                   /**< \brief [10:10] RSI Flag of Buffer 10 (rh) */
    unsigned int RSI11:1;                   /**< \brief [11:11] RSI Flag of Buffer 11 (rh) */
    unsigned int RSI12:1;                   /**< \brief [12:12] RSI Flag of Buffer 12 (rh) */
    unsigned int RSI13:1;                   /**< \brief [13:13] RSI Flag of Buffer 13 (rh) */
    unsigned int RSI14:1;                   /**< \brief [14:14] RSI Flag of Buffer 14 (rh) */
    unsigned int RSI15:1;                   /**< \brief [15:15] RSI Flag of Buffer 15 (rh) */
    unsigned int RSI16:1;                   /**< \brief [16:16] RSI Flag of Buffer 16 (rh) */
    unsigned int RSI17:1;                   /**< \brief [17:17] RSI Flag of Buffer 17 (rh) */
    unsigned int RSI18:1;                   /**< \brief [18:18] RSI Flag of Buffer 18 (rh) */
    unsigned int RSI19:1;                   /**< \brief [19:19] RSI Flag of Buffer 19 (rh) */
    unsigned int RSI20:1;                   /**< \brief [20:20] RSI Flag of Buffer 20 (rh) */
    unsigned int RSI21:1;                   /**< \brief [21:21] RSI Flag of Buffer 21 (rh) */
    unsigned int RSI22:1;                   /**< \brief [22:22] RSI Flag of Buffer 22 (rh) */
    unsigned int RSI23:1;                   /**< \brief [23:23] RSI Flag of Buffer 23 (rh) */
    unsigned int RSI24:1;                   /**< \brief [24:24] RSI Flag of Buffer 24 (rh) */
    unsigned int RSI25:1;                   /**< \brief [25:25] RSI Flag of Buffer 25 (rh) */
    unsigned int RSI26:1;                   /**< \brief [26:26] RSI Flag of Buffer 26 (rh) */
    unsigned int RSI27:1;                   /**< \brief [27:27] RSI Flag of Buffer 27 (rh) */
    unsigned int RSI28:1;                   /**< \brief [28:28] RSI Flag of Buffer 28 (rh) */
    unsigned int RSI29:1;                   /**< \brief [29:29] RSI Flag of Buffer 29 (rh) */
    unsigned int RSI30:1;                   /**< \brief [30:30] RSI Flag of Buffer 30 (rh) */
    unsigned int RSI31:1;                   /**< \brief [31:31] RSI Flag of Buffer 31 (rh) */
} Ifx_PSI5_RSIOV_Bits;

/** \brief  RSIOV Set Register */
typedef struct _Ifx_PSI5_RSISET_Bits
{
    unsigned int RSI0:1;                    /**< \brief [0:0] Set RSI Flag of Buffer 0 (w) */
    unsigned int RSI1:1;                    /**< \brief [1:1] Set RSI Flag of Buffer 1 (w) */
    unsigned int RSI2:1;                    /**< \brief [2:2] Set RSI Flag of Buffer 2 (w) */
    unsigned int RSI3:1;                    /**< \brief [3:3] Set RSI Flag of Buffer 3 (w) */
    unsigned int RSI4:1;                    /**< \brief [4:4] Set RSI Flag of Buffer 4 (w) */
    unsigned int RSI5:1;                    /**< \brief [5:5] Set RSI Flag of Buffer 5 (w) */
    unsigned int RSI6:1;                    /**< \brief [6:6] Set RSI Flag of Buffer 6 (w) */
    unsigned int RSI7:1;                    /**< \brief [7:7] Set RSI Flag of Buffer 7 (w) */
    unsigned int RSI8:1;                    /**< \brief [8:8] Set RSI Flag of Buffer 8 (w) */
    unsigned int RSI9:1;                    /**< \brief [9:9] Set RSI Flag of Buffer 9 (w) */
    unsigned int RSI10:1;                   /**< \brief [10:10] Set RSI Flag of Buffer 10 (w) */
    unsigned int RSI11:1;                   /**< \brief [11:11] Set RSI Flag of Buffer 11 (w) */
    unsigned int RSI12:1;                   /**< \brief [12:12] Set RSI Flag of Buffer 12 (w) */
    unsigned int RSI13:1;                   /**< \brief [13:13] Set RSI Flag of Buffer 13 (w) */
    unsigned int RSI14:1;                   /**< \brief [14:14] Set RSI Flag of Buffer 14 (w) */
    unsigned int RSI15:1;                   /**< \brief [15:15] Set RSI Flag of Buffer 15 (w) */
    unsigned int RSI16:1;                   /**< \brief [16:16] Set RSI Flag of Buffer 16 (w) */
    unsigned int RSI17:1;                   /**< \brief [17:17] Set RSI Flag of Buffer 17 (w) */
    unsigned int RSI18:1;                   /**< \brief [18:18] Set RSI Flag of Buffer 18 (w) */
    unsigned int RSI19:1;                   /**< \brief [19:19] Set RSI Flag of Buffer 19 (w) */
    unsigned int RSI20:1;                   /**< \brief [20:20] Set RSI Flag of Buffer 20 (w) */
    unsigned int RSI21:1;                   /**< \brief [21:21] Set RSI Flag of Buffer 21 (w) */
    unsigned int RSI22:1;                   /**< \brief [22:22] Set RSI Flag of Buffer 22 (w) */
    unsigned int RSI23:1;                   /**< \brief [23:23] Set RSI Flag of Buffer 23 (w) */
    unsigned int RSI24:1;                   /**< \brief [24:24] Set RSI Flag of Buffer 24 (w) */
    unsigned int RSI25:1;                   /**< \brief [25:25] Set RSI Flag of Buffer 25 (w) */
    unsigned int RSI26:1;                   /**< \brief [26:26] Set RSI Flag of Buffer 26 (w) */
    unsigned int RSI27:1;                   /**< \brief [27:27] Set RSI Flag of Buffer 27 (w) */
    unsigned int RSI28:1;                   /**< \brief [28:28] Set RSI Flag of Buffer 28 (w) */
    unsigned int RSI29:1;                   /**< \brief [29:29] Set RSI Flag of Buffer 29 (w) */
    unsigned int RSI30:1;                   /**< \brief [30:30] Set RSI Flag of Buffer 30 (w) */
    unsigned int RSI31:1;                   /**< \brief [31:31] Set RSI Flag of Buffer 31 (w) */
} Ifx_PSI5_RSISET_Bits;

/** \brief  TEIOV Clear Register */
typedef struct _Ifx_PSI5_TEICLR_Bits
{
    unsigned int TEI0:1;                    /**< \brief [0:0] Clear TEI Flag of Buffer 0 (w) */
    unsigned int TEI1:1;                    /**< \brief [1:1] Clear TEI Flag of Buffer 1 (w) */
    unsigned int TEI2:1;                    /**< \brief [2:2] Clear TEI Flag of Buffer 2 (w) */
    unsigned int TEI3:1;                    /**< \brief [3:3] Clear TEI Flag of Buffer 3 (w) */
    unsigned int TEI4:1;                    /**< \brief [4:4] Clear TEI Flag of Buffer 4 (w) */
    unsigned int TEI5:1;                    /**< \brief [5:5] Clear TEI Flag of Buffer 5 (w) */
    unsigned int TEI6:1;                    /**< \brief [6:6] Clear TEI Flag of Buffer 6 (w) */
    unsigned int TEI7:1;                    /**< \brief [7:7] Clear TEI Flag of Buffer 7 (w) */
    unsigned int TEI8:1;                    /**< \brief [8:8] Clear TEI Flag of Buffer 8 (w) */
    unsigned int TEI9:1;                    /**< \brief [9:9] Clear TEI Flag of Buffer 9 (w) */
    unsigned int TEI10:1;                   /**< \brief [10:10] Clear TEI Flag of Buffer 10 (w) */
    unsigned int TEI11:1;                   /**< \brief [11:11] Clear TEI Flag of Buffer 11 (w) */
    unsigned int TEI12:1;                   /**< \brief [12:12] Clear TEI Flag of Buffer 12 (w) */
    unsigned int TEI13:1;                   /**< \brief [13:13] Clear TEI Flag of Buffer 13 (w) */
    unsigned int TEI14:1;                   /**< \brief [14:14] Clear TEI Flag of Buffer 14 (w) */
    unsigned int TEI15:1;                   /**< \brief [15:15] Clear TEI Flag of Buffer 15 (w) */
    unsigned int TEI16:1;                   /**< \brief [16:16] Clear TEI Flag of Buffer 16 (w) */
    unsigned int TEI17:1;                   /**< \brief [17:17] Clear TEI Flag of Buffer 17 (w) */
    unsigned int TEI18:1;                   /**< \brief [18:18] Clear TEI Flag of Buffer 18 (w) */
    unsigned int TEI19:1;                   /**< \brief [19:19] Clear TEI Flag of Buffer 19 (w) */
    unsigned int TEI20:1;                   /**< \brief [20:20] Clear TEI Flag of Buffer 20 (w) */
    unsigned int TEI21:1;                   /**< \brief [21:21] Clear TEI Flag of Buffer 21 (w) */
    unsigned int TEI22:1;                   /**< \brief [22:22] Clear TEI Flag of Buffer 22 (w) */
    unsigned int TEI23:1;                   /**< \brief [23:23] Clear TEI Flag of Buffer 23 (w) */
    unsigned int TEI24:1;                   /**< \brief [24:24] Clear TEI Flag of Buffer 24 (w) */
    unsigned int TEI25:1;                   /**< \brief [25:25] Clear TEI Flag of Buffer 25 (w) */
    unsigned int TEI26:1;                   /**< \brief [26:26] Clear TEI Flag of Buffer 26 (w) */
    unsigned int TEI27:1;                   /**< \brief [27:27] Clear TEI Flag of Buffer 27 (w) */
    unsigned int TEI28:1;                   /**< \brief [28:28] Clear TEI Flag of Buffer 28 (w) */
    unsigned int TEI29:1;                   /**< \brief [29:29] Clear TEI Flag of Buffer 29 (w) */
    unsigned int TEI30:1;                   /**< \brief [30:30] Clear TEI Flag of Buffer 30 (w) */
    unsigned int TEI31:1;                   /**< \brief [31:31] Clear TEI Flag of Buffer 31 (w) */
} Ifx_PSI5_TEICLR_Bits;

/** \brief  TEI Overview Register */
typedef struct _Ifx_PSI5_TEIOV_Bits
{
    unsigned int TEI0:1;                    /**< \brief [0:0] TEI Flag of Buffer 0 (rh) */
    unsigned int TEI1:1;                    /**< \brief [1:1] TEI Flag of Buffer 1 (rh) */
    unsigned int TEI2:1;                    /**< \brief [2:2] TEI Flag of Buffer 2 (rh) */
    unsigned int TEI3:1;                    /**< \brief [3:3] TEI Flag of Buffer 3 (rh) */
    unsigned int TEI4:1;                    /**< \brief [4:4] TEI Flag of Buffer 4 (rh) */
    unsigned int TEI5:1;                    /**< \brief [5:5] TEI Flag of Buffer 5 (rh) */
    unsigned int TEI6:1;                    /**< \brief [6:6] TEI Flag of Buffer 6 (rh) */
    unsigned int TEI7:1;                    /**< \brief [7:7] TEI Flag of Buffer 7 (rh) */
    unsigned int TEI8:1;                    /**< \brief [8:8] TEI Flag of Buffer 8 (rh) */
    unsigned int TEI9:1;                    /**< \brief [9:9] TEI Flag of Buffer 9 (rh) */
    unsigned int TEI10:1;                   /**< \brief [10:10] TEI Flag of Buffer 10 (rh) */
    unsigned int TEI11:1;                   /**< \brief [11:11] TEI Flag of Buffer 11 (rh) */
    unsigned int TEI12:1;                   /**< \brief [12:12] TEI Flag of Buffer 12 (rh) */
    unsigned int TEI13:1;                   /**< \brief [13:13] TEI Flag of Buffer 13 (rh) */
    unsigned int TEI14:1;                   /**< \brief [14:14] TEI Flag of Buffer 14 (rh) */
    unsigned int TEI15:1;                   /**< \brief [15:15] TEI Flag of Buffer 15 (rh) */
    unsigned int TEI16:1;                   /**< \brief [16:16] TEI Flag of Buffer 16 (rh) */
    unsigned int TEI17:1;                   /**< \brief [17:17] TEI Flag of Buffer 17 (rh) */
    unsigned int TEI18:1;                   /**< \brief [18:18] TEI Flag of Buffer 18 (rh) */
    unsigned int TEI19:1;                   /**< \brief [19:19] TEI Flag of Buffer 19 (rh) */
    unsigned int TEI20:1;                   /**< \brief [20:20] TEI Flag of Buffer 20 (rh) */
    unsigned int TEI21:1;                   /**< \brief [21:21] TEI Flag of Buffer 21 (rh) */
    unsigned int TEI22:1;                   /**< \brief [22:22] TEI Flag of Buffer 22 (rh) */
    unsigned int TEI23:1;                   /**< \brief [23:23] TEI Flag of Buffer 23 (rh) */
    unsigned int TEI24:1;                   /**< \brief [24:24] TEI Flag of Buffer 24 (rh) */
    unsigned int TEI25:1;                   /**< \brief [25:25] TEI Flag of Buffer 25 (rh) */
    unsigned int TEI26:1;                   /**< \brief [26:26] TEI Flag of Buffer 26 (rh) */
    unsigned int TEI27:1;                   /**< \brief [27:27] TEI Flag of Buffer 27 (rh) */
    unsigned int TEI28:1;                   /**< \brief [28:28] TEI Flag of Buffer 28 (rh) */
    unsigned int TEI29:1;                   /**< \brief [29:29] TEI Flag of Buffer 29 (rh) */
    unsigned int TEI30:1;                   /**< \brief [30:30] TEI Flag of Buffer 30 (rh) */
    unsigned int TEI31:1;                   /**< \brief [31:31] TEI Flag of Buffer 31 (rh) */
} Ifx_PSI5_TEIOV_Bits;

/** \brief  TEIOV Set Register */
typedef struct _Ifx_PSI5_TEISET_Bits
{
    unsigned int TEI0:1;                    /**< \brief [0:0] Set TEI Flag of Buffer 0 (w) */
    unsigned int TEI1:1;                    /**< \brief [1:1] Set TEI Flag of Buffer 1 (w) */
    unsigned int TEI2:1;                    /**< \brief [2:2] Set TEI Flag of Buffer 2 (w) */
    unsigned int TEI3:1;                    /**< \brief [3:3] Set TEI Flag of Buffer 3 (w) */
    unsigned int TEI4:1;                    /**< \brief [4:4] Set TEI Flag of Buffer 4 (w) */
    unsigned int TEI5:1;                    /**< \brief [5:5] Set TEI Flag of Buffer 5 (w) */
    unsigned int TEI6:1;                    /**< \brief [6:6] Set TEI Flag of Buffer 6 (w) */
    unsigned int TEI7:1;                    /**< \brief [7:7] Set TEI Flag of Buffer 7 (w) */
    unsigned int TEI8:1;                    /**< \brief [8:8] Set TEI Flag of Buffer 8 (w) */
    unsigned int TEI9:1;                    /**< \brief [9:9] Set TEI Flag of Buffer 9 (w) */
    unsigned int TEI10:1;                   /**< \brief [10:10] Set TEI Flag of Buffer 10 (w) */
    unsigned int TEI11:1;                   /**< \brief [11:11] Set TEI Flag of Buffer 11 (w) */
    unsigned int TEI12:1;                   /**< \brief [12:12] Set TEI Flag of Buffer 12 (w) */
    unsigned int TEI13:1;                   /**< \brief [13:13] Set TEI Flag of Buffer 13 (w) */
    unsigned int TEI14:1;                   /**< \brief [14:14] Set TEI Flag of Buffer 14 (w) */
    unsigned int TEI15:1;                   /**< \brief [15:15] Set TEI Flag of Buffer 15 (w) */
    unsigned int TEI16:1;                   /**< \brief [16:16] Set TEI Flag of Buffer 16 (w) */
    unsigned int TEI17:1;                   /**< \brief [17:17] Set TEI Flag of Buffer 17 (w) */
    unsigned int TEI18:1;                   /**< \brief [18:18] Set TEI Flag of Buffer 18 (w) */
    unsigned int TEI19:1;                   /**< \brief [19:19] Set TEI Flag of Buffer 19 (w) */
    unsigned int TEI20:1;                   /**< \brief [20:20] Set TEI Flag of Buffer 20 (w) */
    unsigned int TEI21:1;                   /**< \brief [21:21] Set TEI Flag of Buffer 21 (w) */
    unsigned int TEI22:1;                   /**< \brief [22:22] Set TEI Flag of Buffer 22 (w) */
    unsigned int TEI23:1;                   /**< \brief [23:23] Set TEI Flag of Buffer 23 (w) */
    unsigned int TEI24:1;                   /**< \brief [24:24] Set TEI Flag of Buffer 24 (w) */
    unsigned int TEI25:1;                   /**< \brief [25:25] Set TEI Flag of Buffer 25 (w) */
    unsigned int TEI26:1;                   /**< \brief [26:26] Set TEI Flag of Buffer 26 (w) */
    unsigned int TEI27:1;                   /**< \brief [27:27] Set TEI Flag of Buffer 27 (w) */
    unsigned int TEI28:1;                   /**< \brief [28:28] Set TEI Flag of Buffer 28 (w) */
    unsigned int TEI29:1;                   /**< \brief [29:29] Set TEI Flag of Buffer 29 (w) */
    unsigned int TEI30:1;                   /**< \brief [30:30] Set TEI Flag of Buffer 30 (w) */
    unsigned int TEI31:1;                   /**< \brief [31:31] Set TEI Flag of Buffer 31 (w) */
} Ifx_PSI5_TEISET_Bits;

