luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_regdef.h
/** \brief  Time Stamp Register */
typedef struct _Ifx_PSI5_TSR_Bits
{
    unsigned int CTS:24;                    /**< \brief [23:0] Current Time Stamp for the Module (r) */
    unsigned int ETB:3;                     /**< \brief [26:24] External Time Base Select (rw) */
    unsigned int TBS:1;                     /**< \brief [27:27] Time Base Select (rw) */
    unsigned int reserved_28:2;             /**< \brief \internal Reserved */
    unsigned int ACLR:1;                    /**< \brief [30:30] Clear All Current Time Stamp Counters (w) */
    unsigned int CLR:1;                     /**< \brief [31:31] Clear Current Time Stamp for the Module (w) */
} Ifx_PSI5_TSR_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Psi5_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_ACCEN0_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_ACCEN0;

/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_ACCEN1_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_ACCEN1;

/** \brief  Channel Trigger Value Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_CTV_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_CH_CTV;

/** \brief  Input and Output Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_IOCR_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_IOCR;

/** \brief  Pulse Generation Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_PGC_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_CH_PGC;

/** \brief  Receiver Control Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_RCRA_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_RCRA;

/** \brief  Receiver Control Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_RCRB_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_RCRB;

/** \brief  Receiver Control Register C */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_RCRC_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_RCRC;

/** \brief  Receive Data Register High */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_RDRH_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_RDRH;

/** \brief  Receive Data Register Low */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_RDRL_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_RDRL;

/** \brief  Receive Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_RSR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_CH_RSR;

/** \brief  Send Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SCR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_CH_SCR;

/** \brief  Send Data Register High */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SDRH_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_SDRH;

/** \brief  Send Data Register Low */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SDRL_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_SDRL;

/** \brief  Serial Data and Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SDS_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_CH_SDS;

/** \brief  SOF TS Capture Register SFTSC */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SFTSC_Bits B;               /**< \brief Bitfield access */
} Ifx_PSI5_CH_SFTSC;

/** \brief  Send Output Register High */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SORH_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_SORH;

