luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_regdef.h
/** \brief  Send Output Register Low */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SORL_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_SORL;

/** \brief  SOP TS Capture Register SPTSC */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SPTSC_Bits B;               /**< \brief Bitfield access */
} Ifx_PSI5_CH_SPTSC;

/** \brief  Send Shift Register High */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SSRH_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_SSRH;

/** \brief  Send Shift Register Low */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SSRL_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_SSRL;

/** \brief  Watch Dog Timer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_WDT_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_CH_WDT;

/** \brief  Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CLC_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_CLC;

/** \brief  CRCIOV Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CRCICLR_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CRCICLR;

/** \brief  CRCI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CRCIOV_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_CRCIOV;

/** \brief  CRCIOV Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CRCISET_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CRCISET;

/** \brief  Fractional Divider Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_FDR_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_FDR;

/** \brief  Fractional Divider Register for Time Stamp */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_FDRT_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5_FDRT;

/** \brief  Global Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_GCR_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_GCR;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_ID_Bits B;                     /**< \brief Bitfield access */
} Ifx_PSI5_ID;

/** \brief  Interrupt Node Pointer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INP_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_INP;

/** \brief  Interrupt Clear Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTCLRA_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_INTCLRA;

/** \brief  Interrupt Clear Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTCLRB_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_INTCLRB;

/** \brief  Interrupt Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTENA_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_INTENA;

/** \brief  Interrupt Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTENB_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_INTENB;

/** \brief  Interrupt Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_INTOV;

/** \brief  Interrupt Set Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTSETA_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_INTSETA;

