luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_regdef.h
/** \brief  Interrupt Set Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTSETB_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_INTSETB;

/** \brief  Interrupt Status Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTSTATA_Bits B;               /**< \brief Bitfield access */
} Ifx_PSI5_INTSTATA;

/** \brief  Interrupt Status Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTSTATB_Bits B;               /**< \brief Bitfield access */
} Ifx_PSI5_INTSTATB;

/** \brief  Kernel Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_KRST0_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_KRST0;

/** \brief  Kernel Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_KRST1_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_KRST1;

/** \brief  Kernel Reset Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_KRSTCLR_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_KRSTCLR;

/** \brief  MEIOV Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_MEICLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_MEICLR;

/** \brief  MEI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_MEIOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_MEIOV;

/** \brief  MEIOV Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_MEISET_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_MEISET;

/** \brief  NBIOV Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_NBICLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_NBICLR;

/** \brief  NBI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_NBIOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_NBIOV;

/** \brief  NBIOV Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_NBISET_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_NBISET;

/** \brief  NFIOV Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_NFICLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_NFICLR;

/** \brief  NFI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_NFIOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_NFIOV;

/** \brief  NFIOV Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_NFISET_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_NFISET;

/** \brief  OCDS Control and Status */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_OCS_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_OCS;

/** \brief  Receive Data FIFO */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RDF_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_RDF;

/** \brief  RDIOV Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RDICLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_RDICLR;

/** \brief  RDI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RDIOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_RDIOV;

/** \brief  RDIOV Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RDISET_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_RDISET;

/** \brief  Receive Data Memory High */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RDM_H_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_RDM_H;

/** \brief  Receive Data Memory Low */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RDM_L_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_RDM_L;

/** \brief  Receive FIFO Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RFC_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_RFC;

/** \brief  RMIOV Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RMICLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_RMICLR;

/** \brief  RMI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RMIOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_RMIOV;

/** \brief  RMIOV Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RMISET_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_RMISET;

