luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5_regdef.h
/** \brief  RSIOV Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RSICLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_RSICLR;

/** \brief  RSI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RSIOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_RSIOV;

/** \brief  RSIOV Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RSISET_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_RSISET;

/** \brief  TEIOV Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_TEICLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_TEICLR;

/** \brief  TEI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_TEIOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_TEIOV;

/** \brief  TEIOV Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_TEISET_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_TEISET;

/** \brief  Time Stamp Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_TSR_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_TSR;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Psi5_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  Protection range */
typedef volatile struct _Ifx_PSI5_CH
{
    Ifx_PSI5_CH_IOCR IOCR;                  /**< \brief 0, Input and Output Control Register  */
    Ifx_PSI5_CH_RCRA RCRA;                  /**< \brief 4, Receiver Control Register A  */
    Ifx_PSI5_CH_RCRB RCRB;                  /**< \brief 8, Receiver Control Register B  */
    Ifx_PSI5_CH_RCRC RCRC;                  /**< \brief C, Receiver Control Register C  */
    Ifx_PSI5_CH_WDT WDT[7];                 /**< \brief 10, Watch Dog Timer Register */
    Ifx_PSI5_CH_RSR RSR;                    /**< \brief 2C, Receive Status Register  */
    Ifx_PSI5_CH_SDS SDS[6];                 /**< \brief 30, Serial Data and Status Register */
    Ifx_PSI5_CH_SPTSC SPTSC;                /**< \brief 48, SOP TS Capture Register SPTSC */
    Ifx_PSI5_CH_SFTSC SFTSC;                /**< \brief 4C, SOF TS Capture Register SFTSC */
    Ifx_PSI5_CH_RDRL RDRL;                  /**< \brief 50, Receive Data Register Low  */
    Ifx_PSI5_CH_RDRH RDRH;                  /**< \brief 54, Receive Data Register High  */
    Ifx_PSI5_CH_PGC PGC;                    /**< \brief 58, Pulse Generation Control Register  */
    Ifx_PSI5_CH_CTV CTV;                    /**< \brief 5C, Channel Trigger Value Register  */
    Ifx_PSI5_CH_SCR SCR;                    /**< \brief 60, Send Control Register  */
    Ifx_PSI5_CH_SDRL SDRL;                  /**< \brief 64, Send Data Register Low  */
    Ifx_PSI5_CH_SDRH SDRH;                  /**< \brief 68, Send Data Register High  */
    Ifx_PSI5_CH_SSRL SSRL;                  /**< \brief 6C, Send Shift Register Low  */
    Ifx_PSI5_CH_SSRH SSRH;                  /**< \brief 70, Send Shift Register High  */
    Ifx_PSI5_CH_SORL SORL;                  /**< \brief 74, Send Output Register Low  */
    Ifx_PSI5_CH_SORH SORH;                  /**< \brief 78, Send Output Register High  */
    unsigned char reserved_7C[20];          /**< \brief 7C, \internal Reserved */
} Ifx_PSI5_CH;

/** \brief  Receive data memory */
typedef volatile struct _Ifx_PSI5_RDM
{
    Ifx_PSI5_RDM_L L;                       /**< \brief 0, Receive Data Memory Low */
    Ifx_PSI5_RDM_H H;                       /**< \brief 4, Receive Data Memory High */
} Ifx_PSI5_RDM;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Psi5_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  PSI5 object */
typedef volatile struct _Ifx_PSI5
{
    Ifx_PSI5_CLC CLC;                       /**< \brief 0, Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_PSI5_ID ID;                         /**< \brief 8, Module Identification Register */
    Ifx_PSI5_FDR FDR;                       /**< \brief C, PSI5 Fractional Divider Register */
    Ifx_PSI5_FDR FDRL;                      /**< \brief 10, Fractional Divider Register for Lower Bit Rate */
    Ifx_PSI5_FDR FDRH;                      /**< \brief 14, Fractional Divider Register for Higher Bit Rate */
    Ifx_PSI5_FDRT FDRT;                     /**< \brief 18, Fractional Divider Register for Time Stamp */
    Ifx_PSI5_TSR TSRA;                      /**< \brief 1C, Time Stamp Register A */
    Ifx_PSI5_TSR TSRB;                      /**< \brief 20, Time Stamp Register B */
    Ifx_PSI5_TSR TSRC;                      /**< \brief 24, Time Stamp Register C */
    unsigned char reserved_28[4];           /**< \brief 28, \internal Reserved */
    Ifx_PSI5_GCR GCR;                       /**< \brief 2C, Global Control Register */
    Ifx_PSI5_CH CH[3];                      /**< \brief 30, Protection range */
    unsigned char reserved_1E0[280];        /**< \brief 1E0, \internal Reserved */
    Ifx_PSI5_INTOV INTOV;                   /**< \brief 2F8, Interrupt Overview Register */
    Ifx_PSI5_INP INP[3];                    /**< \brief 2FC, Interrupt Node Pointer Register */
    unsigned char reserved_308[8];          /**< \brief 308, \internal Reserved */
    Ifx_PSI5_INTSTATA INTSTATA[3];          /**< \brief 310, Interrupt Status Register A */
    unsigned char reserved_31C[8];          /**< \brief 31C, \internal Reserved */
    Ifx_PSI5_INTSTATB INTSTATB[3];          /**< \brief 324, Interrupt Status Register B */
    unsigned char reserved_330[8];          /**< \brief 330, \internal Reserved */
    Ifx_PSI5_INTSETA INTSETA[3];            /**< \brief 338, Interrupt Set Register A */
    unsigned char reserved_344[8];          /**< \brief 344, \internal Reserved */
    Ifx_PSI5_INTSETB INTSETB[3];            /**< \brief 34C, Interrupt Set Register B */
    unsigned char reserved_358[8];          /**< \brief 358, \internal Reserved */
    Ifx_PSI5_INTCLRA INTCLRA[3];            /**< \brief 360, Interrupt Clear Register A */
    unsigned char reserved_36C[8];          /**< \brief 36C, \internal Reserved */
    Ifx_PSI5_INTCLRB INTCLRB[3];            /**< \brief 374, Interrupt Clear Register A */
    unsigned char reserved_380[8];          /**< \brief 380, \internal Reserved */
    Ifx_PSI5_INTENA INTENA[3];              /**< \brief 388, Interrupt Enable Register A */
    unsigned char reserved_394[8];          /**< \brief 394, \internal Reserved */
    Ifx_PSI5_INTENB INTENB[3];              /**< \brief 39C, Interrupt Enable Register B */
    unsigned char reserved_3A8[36];         /**< \brief 3A8, \internal Reserved */
    Ifx_PSI5_OCS OCS;                       /**< \brief 3CC, OCDS Control and Status */
    Ifx_PSI5_ACCEN0 ACCEN0;                 /**< \brief 3D0, Access Enable Register 0 */
    Ifx_PSI5_ACCEN1 ACCEN1;                 /**< \brief 3D4, Access Enable Register 1 */
    Ifx_PSI5_KRST0 KRST0;                   /**< \brief 3D8, Kernel Reset Register 0 */
    Ifx_PSI5_KRST1 KRST1;                   /**< \brief 3DC, Kernel Reset Register 1 */
    Ifx_PSI5_KRSTCLR KRSTCLR;               /**< \brief 3E0, Kernel Reset Status Clear Register */
    Ifx_PSI5_RFC RFC[3];                    /**< \brief 3E4, Receive FIFO Control Register */
    unsigned char reserved_3F0[8];          /**< \brief 3F0, \internal Reserved */
    Ifx_PSI5_RDF RDF[3];                    /**< \brief 3F8, Receive Data FIFO */
    unsigned char reserved_404[8];          /**< \brief 404, \internal Reserved */
    Ifx_PSI5_RSIOV RSIOV[3];                /**< \brief 40C, RSI Overview Register */
    unsigned char reserved_418[8];          /**< \brief 418, \internal Reserved */
    Ifx_PSI5_RMIOV RMIOV[3];                /**< \brief 420, RMI Overview Register */
    unsigned char reserved_42C[8];          /**< \brief 42C, \internal Reserved */
    Ifx_PSI5_NBIOV NBIOV[3];                /**< \brief 434, NBI Overview Register */
    unsigned char reserved_440[8];          /**< \brief 440, \internal Reserved */
    Ifx_PSI5_TEIOV TEIOV[3];                /**< \brief 448, TEI Overview Register */
    unsigned char reserved_454[8];          /**< \brief 454, \internal Reserved */
    Ifx_PSI5_CRCIOV CRCIOV[3];              /**< \brief 45C, CRCI Overview Register */
    unsigned char reserved_468[8];          /**< \brief 468, \internal Reserved */
    Ifx_PSI5_RDIOV RDIOV[3];                /**< \brief 470, RDI Overview Register */
    unsigned char reserved_47C[8];          /**< \brief 47C, \internal Reserved */
    Ifx_PSI5_NFIOV NFIOV[3];                /**< \brief 484, NFI Overview Register */
    unsigned char reserved_490[8];          /**< \brief 490, \internal Reserved */
    Ifx_PSI5_MEIOV MEIOV[3];                /**< \brief 498, MEI Overview Register */
    unsigned char reserved_4A4[8];          /**< \brief 4A4, \internal Reserved */
    Ifx_PSI5_RSISET RSISET[3];              /**< \brief 4AC, RSIOV Set Register */
    unsigned char reserved_4B8[8];          /**< \brief 4B8, \internal Reserved */
    Ifx_PSI5_RMISET RMISET[3];              /**< \brief 4C0, RMIOV Set Register */
    unsigned char reserved_4CC[8];          /**< \brief 4CC, \internal Reserved */
    Ifx_PSI5_NBISET NBISET[3];              /**< \brief 4D4, NBIOV Set Register */
    unsigned char reserved_4E0[8];          /**< \brief 4E0, \internal Reserved */
    Ifx_PSI5_TEISET TEISET[3];              /**< \brief 4E8, TEIOV Set Register */
    unsigned char reserved_4F4[8];          /**< \brief 4F4, \internal Reserved */
    Ifx_PSI5_CRCISET CRCISET[3];            /**< \brief 4FC, CRCIOV Set Register */
    unsigned char reserved_508[8];          /**< \brief 508, \internal Reserved */
    Ifx_PSI5_RDISET RDISET[3];              /**< \brief 510, RDIOV Set Register */
    unsigned char reserved_51C[8];          /**< \brief 51C, \internal Reserved */
    Ifx_PSI5_NFISET NFISET[3];              /**< \brief 524, NFIOV Set Register */
    unsigned char reserved_530[8];          /**< \brief 530, \internal Reserved */
    Ifx_PSI5_MEISET MEISET[3];              /**< \brief 538, MEIOV Set Register */
    unsigned char reserved_544[8];          /**< \brief 544, \internal Reserved */
    Ifx_PSI5_RSICLR RSICLR[3];              /**< \brief 54C, RSIOV Clear Register */
    unsigned char reserved_558[8];          /**< \brief 558, \internal Reserved */
    Ifx_PSI5_RMICLR RMICLR[3];              /**< \brief 560, RMIOV Clear Register */
    unsigned char reserved_56C[8];          /**< \brief 56C, \internal Reserved */
    Ifx_PSI5_NBICLR NBICLR[3];              /**< \brief 574, NBIOV Clear Register */
    unsigned char reserved_580[8];          /**< \brief 580, \internal Reserved */
    Ifx_PSI5_TEICLR TEICLR[3];              /**< \brief 588, TEIOV Clear Register */
    unsigned char reserved_594[8];          /**< \brief 594, \internal Reserved */
    Ifx_PSI5_CRCICLR CRCICLR[3];            /**< \brief 59C, CRCIOV Clear Register */
    unsigned char reserved_5A8[8];          /**< \brief 5A8, \internal Reserved */
    Ifx_PSI5_RDICLR RDICLR[3];              /**< \brief 5B0, RDIOV Clear Register */
    unsigned char reserved_5BC[8];          /**< \brief 5BC, \internal Reserved */
    Ifx_PSI5_NFICLR NFICLR[3];              /**< \brief 5C4, NFIOV Clear Register */
    unsigned char reserved_5D0[8];          /**< \brief 5D0, \internal Reserved */
    Ifx_PSI5_MEICLR MEICLR[3];              /**< \brief 5D8, MEIOV Clear Register */
    unsigned char reserved_5E4[28];         /**< \brief 5E4, \internal Reserved */
    Ifx_PSI5_RDM RDM[3][32];                /**< \brief 600, Receive data memory */
    unsigned char reserved_900[512];        /**< \brief 900, \internal Reserved */
} Ifx_PSI5;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPSI5_REGDEF_H */
